[Killed] Block
app/src/bootstrap/App.tsx:10:29
 	isEmailValid: (email: string) => boolean;
 }
 
-const App: React.FC = () => {
-	return <AppRouter />;
-};
+const App: React.FC = () => {};
 
 export default App;
