[Killed] Block
app/src/bootstrap/AppHistory.ts:6:61
 
 const hashHistory = createHashHistory();
 
-function handleRouteChange(currentLocation: Location): void {
-	const isAuthenticated = AuthService.isAuthenticated();
-	if (currentLocation.pathname !== '/login' && !isAuthenticated) {
-		hashHistory.push('/login');
-	} else if (currentLocation.pathname === '/login' && isAuthenticated) {
-		hashHistory.push('/');
-	}
-}
+function handleRouteChange(currentLocation: Location): void {}
 
 hashHistory.listen((location: Location, action: Action) => handleRouteChange(location));

[Killed] Block
app/src/bootstrap/AppHistory.ts:8:65
 
 function handleRouteChange(currentLocation: Location): void {
 	const isAuthenticated = AuthService.isAuthenticated();
-	if (currentLocation.pathname !== '/login' && !isAuthenticated) {
-		hashHistory.push('/login');
-	} else if (currentLocation.pathname === '/login' && isAuthenticated) {
+	if (currentLocation.pathname !== '/login' && !isAuthenticated) {} else if (currentLocation.pathname === '/login' && isAuthenticated) {
 		hashHistory.push('/');
 	}

[Killed] PrefixUnaryExpression
app/src/bootstrap/AppHistory.ts:8:47
 
 function handleRouteChange(currentLocation: Location): void {
 	const isAuthenticated = AuthService.isAuthenticated();
-	if (currentLocation.pathname !== '/login' && !isAuthenticated) {
+	if (currentLocation.pathname !== '/login' && isAuthenticated) {
 		hashHistory.push('/login');
 	} else if (currentLocation.pathname === '/login' && isAuthenticated) {

[Killed] IfStatement
app/src/bootstrap/AppHistory.ts:10:13
 	const isAuthenticated = AuthService.isAuthenticated();
 	if (currentLocation.pathname !== '/login' && !isAuthenticated) {
 		hashHistory.push('/login');
-	} else if (currentLocation.pathname === '/login' && isAuthenticated) {
+	} else if (false) {
 		hashHistory.push('/');
 	}

[Killed] ConditionalExpression
app/src/bootstrap/AppHistory.ts:10:13
 	const isAuthenticated = AuthService.isAuthenticated();
 	if (currentLocation.pathname !== '/login' && !isAuthenticated) {
 		hashHistory.push('/login');
-	} else if (currentLocation.pathname === '/login' && isAuthenticated) {
+	} else if (false && isAuthenticated) {
 		hashHistory.push('/');
 	}

[Survived] ArrowFunction
app/src/bootstrap/AppHistory.ts:15:20
 	}
 }
 
-hashHistory.listen((location: Location, action: Action) => handleRouteChange(location));
+hashHistory.listen(() => undefined);
 
 export default Object.assign({}, hashHistory, {
