[Killed] Block
app/src/routes/AppRouter.tsx:7:22
 import MainRoute from './main/MainRoute';
 import LoginRoute from './login/LoginRoute';
 
-function AppRouter() {
-	React.useEffect(() => {
-		AppHistory.handleRouteChange(AppHistory.location);
-	}, []);
-
-	return (
-		<Router history={AppHistory}>
-			<Route exact path="/" component={MainRoute} />
-			<Route path="/login" component={LoginRoute} />
-		</Router>
-	);
-}
+function AppRouter() {}
 export default AppRouter;
 

[Killed] Block
app/src/routes/AppRouter.tsx:8:24
 import LoginRoute from './login/LoginRoute';
 
 function AppRouter() {
-	React.useEffect(() => {
-		AppHistory.handleRouteChange(AppHistory.location);
-	}, []);
+	React.useEffect(() => {}, []);
 
 	return (
