[Killed] Block
src/routes/login/LoginRoute.tsx:6:23
 import './LoginRoute.scss';
 import { Row, Col } from 'antd';
 
-function LoginRoute() {
-	return (
-		<Row type="flex" justify="center" className="LoginRoute">
-			<Col xs={12}>
-				<LoginForm />
-			</Col>
-		</Row>
-	);
-}
+function LoginRoute() {}
 
 export default LoginRoute;
