[Killed] Block
routes/login/components/LoginForm.tsx:6:22
 import * as AuthService from '../../../services/auth/AuthService';
 
 const validDomains = /@?(anheuser-busch.com|ab-inbev.com|cnd.com.do|cnd.com.do|gmodelo.com.mx|fuzzproductions.com)/;
-function LoginForm() {
-	const onSubmit = (email: string): void => {
-		AuthService.login(email);
-	};
-
-	const isEmailValid = (email: string): boolean => {
-		return email.match(validDomains) !== null;
-	};
-
-	return <LoginFormView onSubmit={onSubmit} isEmailValid={isEmailValid} />;
-}
+function LoginForm() {}
 
 export default LoginForm;

[Killed] Block
routes/login/components/LoginForm.tsx:7:44
 
 const validDomains = /@?(anheuser-busch.com|ab-inbev.com|cnd.com.do|cnd.com.do|gmodelo.com.mx|fuzzproductions.com)/;
 function LoginForm() {
-	const onSubmit = (email: string): void => {
-		AuthService.login(email);
-	};
+	const onSubmit = (email: string): void => {};
 
 	const isEmailValid = (email: string): boolean => {

[Killed] Block
routes/login/components/LoginForm.tsx:11:51
 		AuthService.login(email);
 	};
 
-	const isEmailValid = (email: string): boolean => {
-		return email.match(validDomains) !== null;
-	};
+	const isEmailValid = (email: string): boolean => {};
 
 	return <LoginFormView onSubmit={onSubmit} isEmailValid={isEmailValid} />;

[Killed] BinaryExpression
routes/login/components/LoginForm.tsx:12:36
 	};
 
 	const isEmailValid = (email: string): boolean => {
-		return email.match(validDomains) !== null;
+		return email.match(validDomains) === null;
 	};
 

[Killed] ConditionalExpression
routes/login/components/LoginForm.tsx:12:10
 	};
 
 	const isEmailValid = (email: string): boolean => {
-		return email.match(validDomains) !== null;
+		return true;
 	};
 
