[Killed] Block
routes/login/components/LoginFormView.tsx:22:104
     email: string;
 }
 
-const validateEmail = (email: string, isEmailValid: (email: string) => boolean): string | undefined => {
-    if (!schemaEmailEmpty.isValidSync(email)) {
-        return LoginFormMessage.MESSAGE_REQUIRED;
-    } else if (!schemaEmailFormat.isValidSync(email)) {
-        return LoginFormMessage.MESSAGE_INVALID_EMAIL;
-    } else if (!isEmailValid(email)) {
-        return LoginFormMessage.MESSAGE_NOT_ALLOWED_EMAIL
-    }
-    return undefined;
-}
+const validateEmail = (email: string, isEmailValid: (email: string) => boolean): string | undefined => {}
 
 function LoginFormView(props: Props) {

[Killed] PrefixUnaryExpression
routes/login/components/LoginFormView.tsx:23:9
 }
 
 const validateEmail = (email: string, isEmailValid: (email: string) => boolean): string | undefined => {
-    if (!schemaEmailEmpty.isValidSync(email)) {
+    if (schemaEmailEmpty.isValidSync(email)) {
         return LoginFormMessage.MESSAGE_REQUIRED;
     } else if (!schemaEmailFormat.isValidSync(email)) {

[Killed] IfStatement
routes/login/components/LoginFormView.tsx:23:9
 }
 
 const validateEmail = (email: string, isEmailValid: (email: string) => boolean): string | undefined => {
-    if (!schemaEmailEmpty.isValidSync(email)) {
+    if (false) {
         return LoginFormMessage.MESSAGE_REQUIRED;
     } else if (!schemaEmailFormat.isValidSync(email)) {

[Killed] IfStatement
routes/login/components/LoginFormView.tsx:25:16
 const validateEmail = (email: string, isEmailValid: (email: string) => boolean): string | undefined => {
     if (!schemaEmailEmpty.isValidSync(email)) {
         return LoginFormMessage.MESSAGE_REQUIRED;
-    } else if (!schemaEmailFormat.isValidSync(email)) {
+    } else if (false) {
         return LoginFormMessage.MESSAGE_INVALID_EMAIL;
     } else if (!isEmailValid(email)) {

[Killed] PrefixUnaryExpression
routes/login/components/LoginFormView.tsx:25:16
 const validateEmail = (email: string, isEmailValid: (email: string) => boolean): string | undefined => {
     if (!schemaEmailEmpty.isValidSync(email)) {
         return LoginFormMessage.MESSAGE_REQUIRED;
-    } else if (!schemaEmailFormat.isValidSync(email)) {
+    } else if (schemaEmailFormat.isValidSync(email)) {
         return LoginFormMessage.MESSAGE_INVALID_EMAIL;
     } else if (!isEmailValid(email)) {

[Killed] IfStatement
routes/login/components/LoginFormView.tsx:27:16
         return LoginFormMessage.MESSAGE_REQUIRED;
     } else if (!schemaEmailFormat.isValidSync(email)) {
         return LoginFormMessage.MESSAGE_INVALID_EMAIL;
-    } else if (!isEmailValid(email)) {
+    } else if (true) {
         return LoginFormMessage.MESSAGE_NOT_ALLOWED_EMAIL
     }

[Killed] IfStatement
routes/login/components/LoginFormView.tsx:27:16
         return LoginFormMessage.MESSAGE_REQUIRED;
     } else if (!schemaEmailFormat.isValidSync(email)) {
         return LoginFormMessage.MESSAGE_INVALID_EMAIL;
-    } else if (!isEmailValid(email)) {
+    } else if (false) {
         return LoginFormMessage.MESSAGE_NOT_ALLOWED_EMAIL
     }

[Survived] Block
routes/login/components/LoginFormView.tsx:36:78
 function LoginFormView(props: Props) {
     
 
-    const onSubmit = (values: FormData, actions: FormikActions<FormData>) => {
-        props.onSubmit(values.email)
-        actions.setSubmitting(false);
-    }
+    const onSubmit = (values: FormData, actions: FormikActions<FormData>) => {}
 
     const validate = (values: FormData) => {

[Survived] BooleanSubstitution
routes/login/components/LoginFormView.tsx:38:31
 
     const onSubmit = (values: FormData, actions: FormikActions<FormData>) => {
         props.onSubmit(values.email)
-        actions.setSubmitting(false);
+        actions.setSubmitting(true);
     }
 

[Killed] Block
routes/login/components/LoginFormView.tsx:41:44
         actions.setSubmitting(false);
     }
 
-    const validate = (values: FormData) => {
-        const errors = {} as Error;
-        const returnValidate = validateEmail(values.email, props.isEmailValid) 
-        if(returnValidate){
-            errors.email = returnValidate;
-        }
-        return errors;
-    }
+    const validate = (values: FormData) => {}
 
     const renderHtml = (propsFormik: FormikProps<FormData>) => {

[Killed] IfStatement
routes/login/components/LoginFormView.tsx:44:12
     const validate = (values: FormData) => {
         const errors = {} as Error;
         const returnValidate = validateEmail(values.email, props.isEmailValid) 
-        if(returnValidate){
+        if(false){
             errors.email = returnValidate;
         }

[Killed] Block
routes/login/components/LoginFormView.tsx:44:27
     const validate = (values: FormData) => {
         const errors = {} as Error;
         const returnValidate = validateEmail(values.email, props.isEmailValid) 
-        if(returnValidate){
-            errors.email = returnValidate;
-        }
+        if(returnValidate){}
         return errors;
     }

[Killed] ConditionalExpression
routes/login/components/LoginFormView.tsx:45:13
         const errors = {} as Error;
         const returnValidate = validateEmail(values.email, props.isEmailValid) 
         if(returnValidate){
-            errors.email = returnValidate;
+            true;
         }
         return errors;

[Killed] ConditionalExpression
routes/login/components/LoginFormView.tsx:45:13
         const errors = {} as Error;
         const returnValidate = validateEmail(values.email, props.isEmailValid) 
         if(returnValidate){
-            errors.email = returnValidate;
+            false;
         }
         return errors;

[Killed] Block
routes/login/components/LoginFormView.tsx:50:64
         return errors;
     }
 
-    const renderHtml = (propsFormik: FormikProps<FormData>) => {
-        return <FormikForm>
-            <Card>
-                <h1 id="idTitleProject">{LoginFormMessage.TITLE_LOGIN}</h1>
-                <h3 id="idTitleEnterEmail">{LoginFormMessage.LABEL_EMAIL_INPUT}</h3>
-                <Form.Item validateStatus={propsFormik.errors.email && propsFormik.touched.email ? "error" : "success"} help={propsFormik.touched.email && propsFormik.errors.email}>
-                    <Input type="text" name="email" placeholder={LoginFormMessage.PLACEHOLDER_EMAIL} id="idEmail"
-                        value={propsFormik.values.email}
-                        onChange={propsFormik.handleChange}
-                        onBlur={propsFormik.handleBlur} />
-                </Form.Item>
-                <Form.Item >
-                    <Button type="primary" htmlType="submit" id="idEnter">Enter</Button>
-                </Form.Item>
-            </Card>
-        </FormikForm>
-    }
+    const renderHtml = (propsFormik: FormikProps<FormData>) => {}
 
     return <Formik initialValues={{ email: '' }}

[Killed] ConditionalExpression
routes/login/components/LoginFormView.tsx:55:127
             <Card>
                 <h1 id="idTitleProject">{LoginFormMessage.TITLE_LOGIN}</h1>
                 <h3 id="idTitleEnterEmail">{LoginFormMessage.LABEL_EMAIL_INPUT}</h3>
-                <Form.Item validateStatus={propsFormik.errors.email && propsFormik.touched.email ? "error" : "success"} help={propsFormik.touched.email && propsFormik.errors.email}>
+                <Form.Item validateStatus={propsFormik.errors.email && propsFormik.touched.email ? "error" : "success"} help={false}>
                     <Input type="text" name="email" placeholder={LoginFormMessage.PLACEHOLDER_EMAIL} id="idEmail"
                         value={propsFormik.values.email}

[Killed] ConditionalExpression
routes/login/components/LoginFormView.tsx:55:127
             <Card>
                 <h1 id="idTitleProject">{LoginFormMessage.TITLE_LOGIN}</h1>
                 <h3 id="idTitleEnterEmail">{LoginFormMessage.LABEL_EMAIL_INPUT}</h3>
-                <Form.Item validateStatus={propsFormik.errors.email && propsFormik.touched.email ? "error" : "success"} help={propsFormik.touched.email && propsFormik.errors.email}>
+                <Form.Item validateStatus={propsFormik.errors.email && propsFormik.touched.email ? "error" : "success"} help={true}>
                     <Input type="text" name="email" placeholder={LoginFormMessage.PLACEHOLDER_EMAIL} id="idEmail"
                         value={propsFormik.values.email}

[Killed] StringLiteral
routes/login/components/LoginFormView.tsx:68:44
         </FormikForm>
     }
 
-    return <Formik initialValues={{ email: '' }}
+    return <Formik initialValues={{ email: "Stryker was here!" }}
         onSubmit={onSubmit}
         validate={validate}
