[Killed] Block
app/src/services/Palindrome.ts:1:60
-export function isPalindrome(inputString: string): boolean {
-	if (inputString.length === 0) {
-		return true;
-	} else {
-		const firstChar = inputString.charAt(0);
-		const lastChar = inputString.charAt(inputString.length - 1);
-		const mid = inputString.substring(1, inputString.length - 1);
-		return firstChar === lastChar && isPalindrome(mid);
-	}
-}
+export function isPalindrome(inputString: string): boolean {}
 

[Killed] Block
app/src/services/Palindrome.ts:2:32
 export function isPalindrome(inputString: string): boolean {
-	if (inputString.length === 0) {
-		return true;
-	} else {
+	if (inputString.length === 0) {} else {
 		const firstChar = inputString.charAt(0);
 		const lastChar = inputString.charAt(inputString.length - 1);

[Killed] IfStatement
app/src/services/Palindrome.ts:2:6
 export function isPalindrome(inputString: string): boolean {
-	if (inputString.length === 0) {
+	if (false) {
 		return true;
 	} else {

[Killed] BooleanSubstitution
app/src/services/Palindrome.ts:3:10
 export function isPalindrome(inputString: string): boolean {
 	if (inputString.length === 0) {
-		return true;
+		return false;
 	} else {
 		const firstChar = inputString.charAt(0);

[Killed] Block
app/src/services/Palindrome.ts:4:9
 export function isPalindrome(inputString: string): boolean {
 	if (inputString.length === 0) {
 		return true;
-	} else {
-		const firstChar = inputString.charAt(0);
-		const lastChar = inputString.charAt(inputString.length - 1);
-		const mid = inputString.substring(1, inputString.length - 1);
-		return firstChar === lastChar && isPalindrome(mid);
-	}
+	} else {}
 }
 

[Killed] BinaryExpression
app/src/services/Palindrome.ts:6:58
 		return true;
 	} else {
 		const firstChar = inputString.charAt(0);
-		const lastChar = inputString.charAt(inputString.length - 1);
+		const lastChar = inputString.charAt(inputString.length + 1);
 		const mid = inputString.substring(1, inputString.length - 1);
 		return firstChar === lastChar && isPalindrome(mid);

[Killed] BinaryExpression
app/src/services/Palindrome.ts:7:59
 	} else {
 		const firstChar = inputString.charAt(0);
 		const lastChar = inputString.charAt(inputString.length - 1);
-		const mid = inputString.substring(1, inputString.length - 1);
+		const mid = inputString.substring(1, inputString.length + 1);
 		return firstChar === lastChar && isPalindrome(mid);
 	}

[Killed] ConditionalExpression
app/src/services/Palindrome.ts:8:10
 		const firstChar = inputString.charAt(0);
 		const lastChar = inputString.charAt(inputString.length - 1);
 		const mid = inputString.substring(1, inputString.length - 1);
-		return firstChar === lastChar && isPalindrome(mid);
+		return false;
 	}
 }

[Killed] ConditionalExpression
app/src/services/Palindrome.ts:8:10
 		const firstChar = inputString.charAt(0);
 		const lastChar = inputString.charAt(inputString.length - 1);
 		const mid = inputString.substring(1, inputString.length - 1);
-		return firstChar === lastChar && isPalindrome(mid);
+		return false && isPalindrome(mid);
 	}
 }
