[Killed] Block
src/services/auth/AuthService.ts:1:44
-export function login(email: string): void {
-	window.location.assign(`/login?email=${email}`);
-}
+export function login(email: string): void {}
 
 export function isAuthenticated(): boolean {

[Killed] Block
src/services/auth/AuthService.ts:5:44
 	window.location.assign(`/login?email=${email}`);
 }
 
-export function isAuthenticated(): boolean {
-	return !!localStorage.getItem('system-admin-auth');
-}
+export function isAuthenticated(): boolean {}
 

[Killed] PrefixUnaryExpression
src/services/auth/AuthService.ts:6:10
 }
 
 export function isAuthenticated(): boolean {
-	return !!localStorage.getItem('system-admin-auth');
+	return !localStorage.getItem('system-admin-auth');
 }
 
