[Killed] Block
src/services/navigation/NavigationService.ts:3:47
 import { createHashHistory } from 'history';
 
-export function goToRoute(path: string): void {
-	const history = createHashHistory();
-	history.push(path);
-}
+export function goToRoute(path: string): void {}
 
